ELPasEDT/src/Documents/ПланРасходаРеагентов/ПланРасходаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланРасходаРеагентов</name>
  <registerRecords>AccumulationRegister.ИспользованиеРеагентов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>План</name>
    <attributes>
      <name>Реагент</name>
      <type>
        <types>CatalogRef.Реагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасхода</name>
      <type>
        <types>CatalogRef.ВидыРасходаРеагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеРасхода</name>
      <type>
        <types>CatalogRef.НаправленияРасходаРеагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/AccumulationRegisters/ИспользованиеРеагентов/ИспользованиеРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИспользованиеРеагентов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМоногидратаВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемСработанного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходаРеагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеРасхода</name>
    <type>
      <types>CatalogRef.НаправленияРасходаРеагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ELPasEDT/src/Documents/ПланРасходаРеагентов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ИспользованиеРеагентов 
	Движения.ИспользованиеРеагентов.Записывать = Истина;
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.ИспользованиеРеагентов.Добавить();
		Движение.Период = ТекСтрокаПлан.Период;
		Движение.Сценарий = Сценарий;
		Движение.Организация = Организация;
		Движение.Реагент = ТекСтрокаПлан.Реагент;
		Движение.ВидРасхода = ТекСтрокаПлан.ВидРасхода;
		Движение.НаправлениеРасхода = ТекСтрокаПлан.НаправлениеРасхода;
		Движение.Подразделение = Подразделение;
		Движение.Количество = ТекСтрокаПлан.Количество;
		Движение.КоличествоВБазовойЕдинице = ТекСтрокаПлан.Количество;
	КонецЦикла;

КонецПроцедуры
